---
kind: method
id: M:Autodesk.Revit.DB.ModelPath.Dispose
source: html/3d01a5ed-3c9f-fde4-4899-5a6ef76f7199.htm
---
# Autodesk.Revit.DB.ModelPath.Dispose Method

Releases all resources used by the ModelPath

## Syntax (C#)
```csharp
public void Dispose()
```